In [1]:
# 중간고사 대비 실습 문제 연습1
import pandas as pd

In [2]:
bio_data = {
    "나이":[25, 19, 32],
    "성별":["남","여","남"],
    "키":[185, 163, 172],
    "체중":[89, 52, 68]
}
df = pd.DataFrame(bio_data)
df

   나이 성별    키  체중
0  25  남  185  89
1  19  여  163  52
2  32  남  172  68

In [3]:
# 6. 성명으로 열 추가하기(추가내용 : '홍길동','신사임당','이순신')
df["성명"] = ["홍길동","신사임당","이순신"]
df

   나이 성별    키  체중    성명
0  25  남  185  89   홍길동
1  19  여  163  52  신사임당
2  32  남  172  68   이순신

In [4]:
# 7. 성명을 인덱스로 지정하기
# (원본 수정되도록 옵션 inplace 넣기)
df.set_index("성명",inplace=True)
df

      나이 성별    키  체중
성명
홍길동   25  남  185  89
신사임당  19  여  163  52
이순신   32  남  172  68

In [5]:
# 8.열 중에서 "키"에 대한 평균값을 출력하세요. max 최대값 min최소값 aount개수
df["키"].mean()

173.33333333333334

In [7]:
# 9. 신사임당의 키를 165로 수정하기
df.loc["신사임당","키"] = 165
df

      나이 성별    키  체중
성명
홍길동   25  남  185  89
신사임당  19  여  165  52
이순신   32  남  172  68

In [8]:
# 10. 정약용의 행을 추가하세요.
# 기본값은 0으로 설정하세요.
df.loc["정약용"] = 0
df

      나이 성별    키  체중
성명
홍길동   25  남  185  89
신사임당  19  여  165  52
이순신   32  남  172  68
정약용    0  0    0   0